In [28]:
import pandas as pd
from sqlalchemy import create_engine

### Store CSV into DataFrame

In [29]:
#Loading Min Wage CSV
wage_csv = "min_wage.csv"
min_wage_df = pd.read_csv(wage_csv)
min_wage_df

,Year,State,Table_Data,Footnote,High.Value,Low.Value,CPI.Average,High.2018,Low.2018
0,1968,Alabama,...,NaN,0.00000,0.00000,34.783333,0.00,0.00
1,1968,Alaska,2.1,NaN,2.10000,2.10000,34.783333,15.12,15.12
2,1968,Arizona,18.72 - 26.40/wk(b),(b),0.66000,0.46800,34.783333,4.75,3.37
3,1968,Arkansas,1.25/day(b),(b),0.15625,0.15625,34.783333,1.12,1.12
4,1968,California,1.65(b),(b),1.65000,1.65000,34.783333,11.88,11.88
...,...,...,...,...,...,...,...,...,...
2745,2017,Virginia,7.25[c],[c],7.25000,7.25000,245.119583,7.41,7.41
2746,2017,Washington,11,NaN,11.00000,11.00000,245.119583,11.24,11.24
2747,2017,West Virginia,8.75,NaN,8.75000,8.75000,245.119583,8.94,8.94
2748,2017,Wisconsin,7.25,NaN,7.25000,7.25000,245.119583,7.41,7.41
2749,2017,Wyoming,5.15,NaN,5.15000,5.15000,245.119583,5.26,5.26

In [50]:
#Loading Crime CSV
crime_csv = "crime_data.csv"
crime_data_df = pd.read_csv(crime_csv)
crime_data_df

#Dropping NA column
del crime_data_df['Unnamed: 2']
del crime_data_df['Rape\n(legacy\ndefinition)']
crime_data_df

,State,Area,Population,Violent\ncrime,Murder and \nnonnegligent \nmanslaughter,Robbery,Aggravated \nassault,Property \ncrime,Burglary,Larceny-\ntheft,Motor \nvehicle \ntheft
0,ALABAMA,State Total,"4,863,300","25,886",407,"4,686","18,877","143,362","34,065","97,574","11,723"
1,ALASKA,State Total,"741,894","5,966",52,850,"4,011","24,876","4,053","17,766","3,057"
2,ARIZONA,State Total,"6,931,071","32,583",380,"7,055","21,858","206,432","37,736","150,275","18,421"
3,ARKANSAS,State Total,"2,988,248","16,461",216,"2,120","11,982","97,673","23,771","66,747","7,155"
4,CALIFORNIA,State Total,"39,250,017","174,796","1,930","54,789","104,375","1,002,070","188,304","637,010","176,756"
5,COLORADO,State Total,"5,540,545","18,983",204,"3,528","11,696","151,850","23,903","108,336","19,611"
6,CONNECTICUT,State Total,"3,576,452","8,123",78,"2,703","4,579","64,664","10,045","47,512","7,107"
7,DELAWARE,State Total,"952,065","4,844",56,"1,359","3,121","26,334","5,023","19,791","1,520"
8,DISTRICT OF COLUMBIA,State Total,"681,170","8,214",139,"3,480","4,063","32,716","2,361","27,382","2,973"
9,FLORIDA,State Total,"20,612,439","88,700","1,111","20,175","59,816","553,812","100,325","410,352","43,135"
10,GEORGIA5,State Total,"10,310,371","40,990",681,"12,205","24,595","309,770","63,344","219,625","26,801"
11,HAWAII,State Total,"1,428,557","4,417",35,994,"2,769","42,753","6,017","31,082","5,654"
12,IDAHO,State Total,"1,683,140","3,876",49,213,"2,895","29,357","6,318","20,962","2,077"
13,ILLINOIS,State Total,"12,801,539","55,854","1,054","17,827","32,065","262,306","47,989","194,407","19,910"
14,INDIANA,State Total,"6,633,053","26,845",439,"7,330","16,575","171,759","34,097","122,931","14,731"
15,IOWA,State Total,"3,134,693","9,110",71,"1,148","6,644","65,391","15,030","45,378","4,983"
16,KANSAS,State Total,"2,907,289","11,060",111,"1,671","7,966","78,367","14,364","57,066","6,937"
17,KENTUCKY,State Total,"4,436,974","10,308",260,"3,369","5,038","97,158","20,834","66,438","9,886"
18,LOUISIANA,State Total,"4,681,666","26,502",554,"5,576","18,556","154,386","34,667","109,380","10,339"
19,MAINE,State Total,"1,331,479","1,648",20,266,950,"21,912","4,003","17,134",775
20,MARYLAND,State Total,"6,016,447","28,400",481,"10,289","15,874","137,445","24,692","100,919","11,834"
21,MASSACHUSETTS,State Total,"6,811,779","25,677",134,"5,365","18,050","106,339","19,193","79,088","8,058"
22,MICHIGAN,State Total,"9,928,300","45,572",598,"7,120","30,729","189,620","39,568","129,876","20,176"
23,MINNESOTA,State Total,"5,519,952","13,394",101,"3,728","7,217","117,756","18,606","90,422","8,728"
24,MISSISSIPPI,State Total,"2,988,726","8,383",238,"2,397","4,471","82,732","23,354","55,054","4,324"
25,MISSOURI,State Total,"6,093,000","31,644",537,"6,570","21,983","170,549","31,710","120,544","18,295"
26,MONTANA,State Total,"1,042,520","3,840",36,266,"2,960","27,976","3,934","21,299","2,743"
27,NEBRASKA,State Total,"1,907,116","5,550",49,946,"3,561","43,163","6,444","31,994","4,725"
28,NEVADA,State Total,"2,940,058","19,936",224,"6,340","11,639","76,047","18,850","44,017","13,180"
29,NEW HAMPSHIRE,State Total,"1,334,795","2,637",17,427,"1,611","20,194","2,963","16,360",871
30,NEW JERSEY,State Total,"8,944,469","21,914",372,"8,984","11,105","138,152","25,284","101,540","11,328"
31,NEW MEXICO,State Total,"2,081,015","14,619",139,"2,737","10,217","81,931","17,281","52,907","11,743"
32,NEW YORK,State Total,"19,745,289","74,285",630,"22,316","45,079","305,181","39,821","250,968","14,392"
33,NORTH CAROLINA,State Total,"10,146,788","37,769",678,"9,336","24,906","277,765","72,082","190,377","15,306"
34,NORTH DAKOTA,State Total,"757,952","1,903",15,181,"1,365","17,402","3,243","12,195","1,964"
35,OHIO6,State Total,"11,614,373","34,877",654,"12,523","16,111","299,357","66,883","212,807","19,667"
36,OKLAHOMA,State Total,"3,923,561","17,648",245,"3,162","12,202","117,037","29,103","75,779","12,155"
37,OREGON,State Total,"4,093,465","10,830",113,"2,278","6,718","121,345","16,866","91,286","13,193"
38,PENNSYLVANIA,State Total,"12,784,227","40,447",661,"12,326","23,027","222,795","35,520","174,228","13,047"
39,PUERTO RICO,State Total,"3,411,307","7,643",679,"3,201","3,594","35,201","8,251","23,163","3,787"
40,RHODE ISLAND,State Total,"1,056,426","2,524",29,540,"1,513","20,058","3,788","14,674","1,596"
41,SOUTH CAROLINA,State Total,"4,961,119","24,896",366,"4,035","18,108","160,928","32,976","114,032","13,920"
42,SOUTH DAKOTA,State Total,"865,454","3,621",27,272,"2,813","17,141","3,000","12,639","1,502"
43,TENNESSEE,State Total,"6,651,194","42,097",486,"7,813","31,084","189,835","40,312","134,404","15,119"
44,TEXAS,State Total,"27,862,596","121,042","1,478","33,317","72,880","768,947","148,740","551,151","69,056"
45,UTAH,State Total,"3,051,217","7,407",72,"1,541","4,274","90,058","12,836","67,834","9,388"
46,VERMONT,State Total,"624,594",989,14,106,691,"10,602","2,103","8,217",282
47,VIRGINIA,State Total,"8,411,808","18,302",484,"4,803","10,278","156,412","20,018","126,606","9,788"
48,WASHINGTON,State Total,"7,288,000","22,023",195,"5,651","13,100","254,653","49,180","173,187","32,286"
49,WEST VIRGINIA,State Total,"1,831,102","6,557",81,720,"5,099","37,487","9,301","25,677","2,509"
50,WISCONSIN,State Total,"5,778,708","17,679",229,"4,706","10,765","111,720","19,425","82,337","9,958"
51,WYOMING,State Total,"585,501","1,430",20,59,"1,146","11,460","1,771","8,889",800

### Create new data with select columns

In [42]:
#Extracting data from year 2016 to match the crime csv
new_min_df = min_wage_df[['Year', 'State', 'High.Value', 'High.2018']].copy()
new_min_df = new_min_df.loc[new_min_df['Year'] == 2016]
new_min_df.head()

      Year       State  High.Value  High.2018
2640  2016     Alabama        0.00       0.00
2641  2016      Alaska        9.75      10.17
2642  2016     Arizona        8.05       8.40
2643  2016    Arkansas        8.00       8.35
2644  2016  California       10.00      10.43

### Clean DataFrame

In [43]:
new_min_df.head()

      Year       State  High.Value  High.2018
2640  2016     Alabama        0.00       0.00
2641  2016      Alaska        9.75      10.17
2642  2016     Arizona        8.05       8.40
2643  2016    Arkansas        8.00       8.35
2644  2016  California       10.00      10.43

In [44]:
#rename columns
new_min_df.rename(columns = {'High.Value':'Minimum Wage',
                                         'High.2018':'2018 Modern Equivalent'}, inplace=True)

In [45]:
new_min_df.head()

      Year       State  Minimum Wage  2018 Modern Equivalent
2640  2016     Alabama          0.00                    0.00
2641  2016      Alaska          9.75                   10.17
2642  2016     Arizona          8.05                    8.40
2643  2016    Arkansas          8.00                    8.35
2644  2016  California         10.00                   10.43

### Connect to local database

In [46]:
rds_connection_string = "postgres:postgres@localhost:5432/crime_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

### Check for tables

In [47]:
engine.table_names()

['minimum wage', 'crime data']

### Use pandas to load csv converted DataFrame into database

In [53]:
new_min_df.to_sql(name='minimum_wage', con=engine, if_exists='append', index=False)

### Use pandas to load json converted DataFrame into database

In [54]:
crime_data_df.to_sql(name='crime_data', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the customer_name table
* NOTE: can also check using pgAdmin

In [56]:
pd.read_sql_query('select * from minimum_wage', con=engine).head()

   Year       State  Minimum Wage  2018 Modern Equivalent
0  2016     Alabama          0.00                    0.00
1  2016      Alaska          9.75                   10.17
2  2016     Arizona          8.05                    8.40
3  2016    Arkansas          8.00                    8.35
4  2016  California         10.00                   10.43

### Confirm data has been added by querying the customer_location table

In [55]:
pd.read_sql_query('select * from crime_data', con=engine).head()

,State,Area,Population,Violent\ncrime,Murder and \nnonnegligent \nmanslaughter,Robbery,Aggravated \nassault,Property \ncrime,Burglary,Larceny-\ntheft,Motor \nvehicle \ntheft
0,ALABAMA,State Total,"4,863,300","25,886",407,"4,686","18,877","143,362","34,065","97,574","11,723"
1,ALASKA,State Total,"741,894","5,966",52,850,"4,011","24,876","4,053","17,766","3,057"
2,ARIZONA,State Total,"6,931,071","32,583",380,"7,055","21,858","206,432","37,736","150,275","18,421"
3,ARKANSAS,State Total,"2,988,248","16,461",216,"2,120","11,982","97,673","23,771","66,747","7,155"
4,CALIFORNIA,State Total,"39,250,017","174,796","1,930","54,789","104,375","1,002,070","188,304","637,010","176,756"